[
    {
        "name": "Alfred Pennyworth",
        "skills": [
            "Communication",
            "Administration",
            "Css",
            "Agile",
            "Project management",
            "Design",
            "Market research",
            "Computer science",
            "Product management",
            "Research",
            "Java",
            "Budget",
            "Analysis",
            "Python",
            "Data analysis",
            "User experience",
            "System",
            "Aws",
            "Testing",
            "Html",
            "Sql",
            "Facebook",
            "Automation",
            "Javascript"
        ],
        "experience": [
            "meet business goals.",
            "2012 – 2017 Software Development Engineer III, Amazon, Seattle, WA, USA",
            "Led a team of developers in building scalable and high-performing e-commerce applications."
        ],
        "degree": null,
        "total_experience": 0.0
    },
    {
        "name": "Barry Allen",
        "skills": [
            "Engineering",
            "Babel",
            "Ui",
            "Cloud",
            "Python",
            "Agile",
            "Javascript",
            "Design",
            "Vue.js",
            "Ux",
            "Computer science",
            "Html5",
            "Apis",
            "Docker"
        ],
        "experience": [
            "June 2022 –",
            "Present",
            "Software Engineer (Front-End), Google, Mountain View, CA, USA",
            "Developing intuitive and engaging user interfaces using React and Redux. Working closely",
            "with UX designers to implement responsive and accessible web design. Participating in",
            "agile development processes, including sprint planning and code reviews. Collaborating with",
            "back-end developers to integrate RESTful APIs and ensure seamless data flow."
        ],
        "degree": null,
        "total_experience": 0.0
    },
    {
        "name": "Bruce Wayne",
        "skills": [
            "Communication",
            "Ux",
            "Agile",
            "Apis",
            "Coding",
            "Design",
            "Computer science",
            "Github",
            "Python",
            "User experience",
            "Ai",
            "System",
            "Docker",
            "Facebook",
            "Plan",
            "Scrum",
            "Api",
            "Javascript",
            "Algorithms",
            "Architecture"
        ],
        "experience": [
            "June 2020 –",
            "Present",
            "July 2015 –",
            "May 2020",
            "June 2012 –",
            "June 2015",
            "MERN Stack Developer, OpenAI, San Francisco, USA",
            "Working on the development of the ChatGPT project, using Node.js, Express.js, and React.",
            "Implementing RESTful services for communication between frontend and backend. Utilizing",
            "Docker and Kubernetes for deployment and management of applications. Working in an",
            "Agile environment, delivering high-quality software every sprint. Contributing to the design",
            "and implementation of machine learning algorithms for natural language processing tasks.",
            "Full Stack Developer, Uber, San Francisco, USA",
            "Developed and maintained scalable web applications using MERN stack. Ensured the",
            "performance, quality, and responsiveness of applications. Successfully deployed solutions",
            "using Docker and Kubernetes. Collaborated with a team of engineers, product managers,",
            "and UX designers. Led a team of junior developers, conducted code reviews, and ensured",
            "adherence to best coding practices. Worked closely with the data science team to optimize",
            "recommendation algorithms and enhance user experience.",
            "Software Developer, Facebook, Menlo Park, USA",
            "Developed features for the Facebook web application using React. Ensured the performance",
            "of the MongoDB databases. Utilized RESTful APIs for communication between different",
            "parts of the application. Worked in a fast-paced, test-driven development environment.",
            "Assisted in migrating the legacy system to a modern MERN stack architecture."
        ],
        "degree": [
            "Bachelor of Science in Computer Science"
        ],
        "total_experience": 0.0
    },
    {
        "name": "Harvey Dent",
        "skills": [
            "Statistics",
            "Tensorflow",
            "Agile",
            "Pytorch",
            "Computer science",
            "Research",
            "Training",
            "Keras",
            "R",
            "Analysis",
            "Python",
            "Datasets",
            "Ai",
            "Testing",
            "Docker",
            "Facebook",
            "Sql",
            "Scrum",
            "Nosql",
            "Algorithms"
        ],
        "experience": [
            "2021 –",
            "Present",
            "Machine Learning Engineer, OpenAI, San Francisco, USA",
            "Leading a team of AI engineers. Designed and implemented deep learning models for natural",
            "language processing tasks. Improved the efficiency of model training and data processing",
            "pipelines. Published several research papers in top-tier AI conferences.",
            "2018 – 2021 Data Scientist, Uber, San Francisco, USA",
            "Developed and deployed machine learning models to improve the efficiency of ride allocation",
            "algorithms. Utilized TensorFlow and PyTorch for developing predictive models. Analyzed",
            "and visualized large data sets to drive business strategies.",
            "2016 – 2018 Junior Data Analyst, Facebook, Menlo Park, USA",
            "Analyzed and visualized large datasets using Python and R. Assisted in the development of",
            "machine learning models for user behavior prediction. Conducted A/B testing and provided",
            "insights to the product team."
        ],
        "degree": [
            "Bachelor of Science in Computer Science"
        ],
        "total_experience": 0.0
    },
    {
        "name": "JOHN DOE",
        "skills": [
            "Debugging",
            "Queries",
            "Agile",
            "Troubleshooting",
            "Apis",
            "Computer science",
            "Html5",
            "Java",
            "Github",
            "Analysis",
            "Mysql",
            "User experience",
            "System",
            "Docker",
            "Testing",
            "Sql",
            "Scrum",
            "Oracle",
            "Nosql",
            "Javascript"
        ],
        "experience": [
            "by 30",
            "• Integrated applications with MySQL and MongoDB databases to store and retrieve data efficiently",
            "• Collaborated in an Agile development team to deliver high-quality software every sprint",
            "• Created RESTful services and APIs for frontend and third-party applications",
            "• Wrote unit tests using Junit and Mockito for robust testing of application components",
            "Software Developer, XYZ Solutions, Anywhere, USA, July 2016 - June 2018",
            "• Participated in the complete software development life cycle from requirement analysis to deploy-",
            "ment",
            "• Implemented business logic using Java and enhanced user interface using Angular",
            "• Developed and maintained SQL and NoSQL databases, implementing complex queries for business",
            "needs",
            "• Utilized Git for version control and collaborated with team members via GitHub",
            "• Assisted in troubleshooting, software debugging, and system enhancements",
            "1"
        ],
        "degree": [
            "Bachelor of Science in Computer Science, State University"
        ],
        "total_experience": 1.92
    },
    {
        "name": "Florida Polytechnic University",
        "skills": [
            "Security",
            "Audio",
            "Calculus",
            "Statistics",
            "Responses",
            "Css",
            "Warehouse",
            "Powerpoint",
            "Coding",
            "Pydub",
            "Android",
            "Documentation",
            "Computer science",
            "Training",
            "Interactive",
            "Java",
            "Analyze",
            "Programming",
            "Github",
            "Numpy",
            "Modeling",
            "Python",
            "Matplotlib",
            "Word",
            "System",
            "Physics",
            "Tkinter",
            "Ai",
            "Aws",
            "Html",
            "Sql",
            "C",
            "Excel",
            "Safety",
            "Engineering",
            "Machine learning",
            "Mathematics",
            "Algorithms"
        ],
        "experience": [
            "Remotasks AI Trainer – Coding Team (Spring 2024)",
            "Worked as part of Remotasks’s coding team, completing coding tasks for the Bulba project. Assisted in",
            "training AI chatbots by reviewing, assessing, and comparing their responses to prompts. Wrote and rewrote",
            "coding solutions to problems with justification and documentation for each.",
            "Amazon Air Associate – Warehouse (Summer 2024 – Present)",
            "Worked in Amazon Air’s Dock Department, following many standards regarding safety and productivity.",
            "City of Winter Haven Volunteer – Computer Science (Summer 2024 – Present)"
        ],
        "degree": null,
        "total_experience": 0.0
    }
]